esp-rs/esp-pacs/esp32h2/svd/esp32h2.base.svd
        <register>
          <name>L1_CACHE_SYNC_PRELOAD_INT_RAW</name>
          <description>Sync Preload operation Interrupt raw register</description>
          <addressOffset>0x22C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_ICACHE0_PLD_DONE_INT_RAW</name>
              <description>The raw bit of the interrupt that occurs only when L1-ICache0 preload-operation is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_PLD_DONE_INT_RAW</name>
              <description>The raw bit of the interrupt that occurs only when L1-ICache1 preload-operation is done.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE2_PLD_DONE_INT_RAW</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE3_PLD_DONE_INT_RAW</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_PLD_DONE_INT_RAW</name>
              <description>The raw bit of the interrupt that occurs only when L1-Cache preload-operation is done.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_SYNC_DONE_INT_RAW</name>
              <description>The raw bit of the interrupt that occurs only when Cache sync-operation is done.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE0_PLD_ERR_INT_RAW</name>
              <description>The raw bit of the interrupt that occurs only when L1-ICache0 preload-operation error occurs.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_PLD_ERR_INT_RAW</name>
              <description>The raw bit of the interrupt that occurs only when L1-ICache1 preload-operation error occurs.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE2_PLD_ERR_INT_RAW</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE3_PLD_ERR_INT_RAW</name>
              <description>Reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_PLD_ERR_INT_RAW</name>
              <description>The raw bit of the interrupt that occurs only when L1-Cache preload-operation error occurs.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_SYNC_ERR_INT_RAW</name>
              <description>The raw bit of the interrupt that occurs only when Cache sync-operation error occurs.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_SYNC_PRELOAD_INT_ST</name>
          <description>L1-Cache Access Fail Interrupt status register</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_ICACHE0_PLD_DONE_INT_ST</name>
              <description>The bit indicates the status of the interrupt that occurs only when L1-ICache0 preload-operation is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_PLD_DONE_INT_ST</name>
              <description>The bit indicates the status of the interrupt that occurs only when L1-ICache1 preload-operation is done.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_PLD_DONE_INT_ST</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_PLD_DONE_INT_ST</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_CACHE_PLD_DONE_INT_ST</name>
              <description>The bit indicates the status of the interrupt that occurs only when L1-Cache preload-operation is done.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_SYNC_DONE_INT_ST</name>
              <description>The bit indicates the status of the interrupt that occurs only when Cache sync-operation is done.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE0_PLD_ERR_INT_ST</name>
              <description>The bit indicates the status of the interrupt of L1-ICache0 preload-operation error.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_PLD_ERR_INT_ST</name>
              <description>The bit indicates the status of the interrupt of L1-ICache1 preload-operation error.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_PLD_ERR_INT_ST</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_PLD_ERR_INT_ST</name>
              <description>Reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_CACHE_PLD_ERR_INT_ST</name>
              <description>The bit indicates the status of the interrupt of L1-Cache preload-operation error.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_SYNC_ERR_INT_ST</name>
              <description>The bit indicates the status of the interrupt of Cache sync-operation error.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_SYNC_PRELOAD_EXCEPTION</name>
          <description>Cache Sync/Preload Operation exception register</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_ICACHE0_PLD_ERR_CODE</name>
              <description>The value 2 is Only available which means preload size is error in L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_PLD_ERR_CODE</name>
              <description>The value 2 is Only available which means preload size is error in L1-ICache1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_PLD_ERR_CODE</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_PLD_ERR_CODE</name>
              <description>Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_CACHE_PLD_ERR_CODE</name>
              <description>The value 2 is Only available which means preload size is error in L1-Cache.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHE_SYNC_ERR_CODE</name>
              <description>The values 0-2 are available which means sync map, command conflict and size are error in Cache System.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_SYNC_RST_CTRL</name>
          <description>Cache Sync Reset control register</description>
          <addressOffset>0x238</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_ICACHE0_SYNC_RST</name>
              <description>set this bit to reset sync-logic inside L1-ICache0. Recommend that this should only be used to initialize sync-logic when some fatal error of sync-logic occurs.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_SYNC_RST</name>
              <description>set this bit to reset sync-logic inside L1-ICache1. Recommend that this should only be used to initialize sync-logic when some fatal error of sync-logic occurs.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_SYNC_RST</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_SYNC_RST</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_CACHE_SYNC_RST</name>
              <description>set this bit to reset sync-logic inside L1-Cache. Recommend that this should only be used to initialize sync-logic when some fatal error of sync-logic occurs.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_PRELOAD_RST_CTRL</name>
          <description>Cache Preload Reset control register</description>
          <addressOffset>0x23C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_ICACHE0_PLD_RST</name>
              <description>set this bit to reset preload-logic inside L1-ICache0. Recommend that this should only be used to initialize preload-logic when some fatal error of preload-logic occurs.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_PLD_RST</name>
              <description>set this bit to reset preload-logic inside L1-ICache1. Recommend that this should only be used to initialize preload-logic when some fatal error of preload-logic occurs.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_PLD_RST</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_PLD_RST</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_CACHE_PLD_RST</name>
              <description>set this bit to reset preload-logic inside L1-Cache. Recommend that this should only be used to initialize preload-logic when some fatal error of preload-logic occurs.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_AUTOLOAD_BUF_CLR_CTRL</name>
          <description>Cache Autoload buffer clear control register</description>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_ICACHE0_ALD_BUF_CLR</name>
              <description>set this bit to clear autoload-buffer inside L1-ICache0. If this bit is active, autoload will not work in L1-ICache0. This bit should not be active when autoload works in L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_ALD_BUF_CLR</name>
              <description>set this bit to clear autoload-buffer inside L1-ICache1. If this bit is active, autoload will not work in L1-ICache1. This bit should not be active when autoload works in L1-ICache1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_ALD_BUF_CLR</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_ALD_BUF_CLR</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_CACHE_ALD_BUF_CLR</name>
              <description>set this bit to clear autoload-buffer inside L1-Cache. If this bit is active, autoload will not work in L1-Cache. This bit should not be active when autoload works in L1-Cache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_UNALLOCATE_BUFFER_CLEAR</name>
          <description>Unallocate request buffer clear registers</description>
          <addressOffset>0x244</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_ICACHE0_UNALLOC_CLR</name>
              <description>The bit is used to clear the unallocate request buffer of l1 icache0 where the unallocate request is responsed but not completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_UNALLOC_CLR</name>
              <description>The bit is used to clear the unallocate request buffer of l1 icache1 where the unallocate request is responsed but not completed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_UNALLOC_CLR</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_UNALLOC_CLR</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_CACHE_UNALLOC_CLR</name>
              <description>The bit is used to clear the unallocate request buffer of l1 cache where the unallocate request is responsed but not completed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_OBJECT_CTRL</name>
          <description>Cache Tag and Data memory Object control register</description>
          <addressOffset>0x248</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_ICACHE0_TAG_OBJECT</name>
              <description>Set this bit to set L1-ICache0 tag memory as object. This bit should be onehot with the others fields inside this register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_TAG_OBJECT</name>
              <description>Set this bit to set L1-ICache1 tag memory as object. This bit should be onehot with the others fields inside this register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_TAG_OBJECT</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_TAG_OBJECT</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_CACHE_TAG_OBJECT</name>
              <description>Set this bit to set L1-Cache tag memory as object. This bit should be onehot with the others fields inside this register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE0_MEM_OBJECT</name>
              <description>Set this bit to set L1-ICache0 data memory as object. This bit should be onehot with the others fields inside this register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_MEM_OBJECT</name>
              <description>Set this bit to set L1-ICache1 data memory as object. This bit should be onehot with the others fields inside this register.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_MEM_OBJECT</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_MEM_OBJECT</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_CACHE_MEM_OBJECT</name>
              <description>Set this bit to set L1-Cache data memory as object. This bit should be onehot with the others fields inside this register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_WAY_OBJECT</name>
          <description>Cache Tag and Data memory way register</description>
          <addressOffset>0x24C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_CACHE_WAY_OBJECT</name>
              <description>Set this bits to select which way of the tag-object will be accessed. 0: way0, 1: way1, 2: way2, 3: way3, ?, 7: way7.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_VADDR</name>
          <description>Cache Vaddr register</description>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
          <resetValue>0x40000000</resetValue>
          <fields>
            <field>
              <name>L1_CACHE_VADDR</name>
              <description>Those bits stores the virtual address which will decide where inside the specified tag memory object will be accessed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_DEBUG_BUS</name>
          <description>Cache Tag/data memory content register</description>
          <addressOffset>0x254</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000254</resetValue>
          <fields>
            <field>
              <name>L1_CACHE_DEBUG_BUS</name>
              <description>This is a constant place where we can write data to or read data from the tag/data memory on the specified cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
