esp-rs/esp-pacs/esp32h2/svd/esp32h2.base.svd
        <register>
          <name>L2_DBUS3_ACS_MISS_CNT</name>
          <description>L2-Cache bus3 Miss-Access Counter register</description>
          <addressOffset>0x35C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_DBUS3_MISS_CNT</name>
              <description>The register records the number of missing when L1-DCache accesses L2-Cache due to bus3 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_DBUS3_ACS_CONFLICT_CNT</name>
          <description>L2-Cache bus3 Conflict-Access Counter register</description>
          <addressOffset>0x360</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_DBUS3_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when L1-DCache accesses L2-Cache due to bus3 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_DBUS3_ACS_NXTLVL_CNT</name>
          <description>L2-Cache bus3 Next-Level-Access Counter register</description>
          <addressOffset>0x364</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_DBUS3_NXTLVL_CNT</name>
              <description>The register records the number of times that L2-Cache accesses external memory due to L1-DCache accessing L2-Cache due to bus3 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_ACS_FAIL_ID_ATTR</name>
          <description>L2-Cache Access Fail ID/attribution information register</description>
          <addressOffset>0x368</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_FAIL_ID</name>
              <description>The register records the ID of fail-access when L1-Cache accesses L2-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_FAIL_ATTR</name>
              <description>The register records the attribution of fail-access when L1-Cache accesses L2-Cache due to cache accessing L1-Cache.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_ACS_FAIL_ADDR</name>
          <description>L2-Cache Access Fail Address information register</description>
          <addressOffset>0x36C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_FAIL_ADDR</name>
              <description>The register records the address of fail-access when L1-Cache accesses L2-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_SYNC_PRELOAD_INT_ENA</name>
          <description>L1-Cache Access Fail Interrupt enable register</description>
          <addressOffset>0x370</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_PLD_DONE_INT_ENA</name>
              <description>The bit is used to enable interrupt of L2-Cache preload-operation done.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_PLD_ERR_INT_ENA</name>
              <description>The bit is used to enable interrupt of L2-Cache preload-operation error.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_SYNC_PRELOAD_INT_CLR</name>
          <description>Sync Preload operation Interrupt clear register</description>
          <addressOffset>0x374</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_PLD_DONE_INT_CLR</name>
              <description>The bit is used to clear interrupt that occurs only when L2-Cache preload-operation is done.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_PLD_ERR_INT_CLR</name>
              <description>The bit is used to clear interrupt of L2-Cache preload-operation error.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_SYNC_PRELOAD_INT_RAW</name>
          <description>Sync Preload operation Interrupt raw register</description>
          <addressOffset>0x378</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_PLD_DONE_INT_RAW</name>
              <description>The raw bit of the interrupt that occurs only when L2-Cache preload-operation is done.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L2_CACHE_PLD_ERR_INT_RAW</name>
              <description>The raw bit of the interrupt that occurs only when L2-Cache preload-operation error occurs.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_SYNC_PRELOAD_INT_ST</name>
          <description>L1-Cache Access Fail Interrupt status register</description>
          <addressOffset>0x37C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_PLD_DONE_INT_ST</name>
              <description>The bit indicates the status of the interrupt that occurs only when L2-Cache preload-operation is done.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_PLD_ERR_INT_ST</name>
              <description>The bit indicates the status of the interrupt of L2-Cache preload-operation error.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_SYNC_PRELOAD_EXCEPTION</name>
          <description>Cache Sync/Preload Operation exception register</description>
          <addressOffset>0x380</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_PLD_ERR_CODE</name>
              <description>The value 2 is Only available which means preload size is error in L2-Cache.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_SYNC_RST_CTRL</name>
          <description>Cache Sync Reset control register</description>
          <addressOffset>0x384</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_SYNC_RST</name>
              <description>set this bit to reset sync-logic inside L2-Cache. Recommend that this should only be used to initialize sync-logic when some fatal error of sync-logic occurs.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_PRELOAD_RST_CTRL</name>
          <description>Cache Preload Reset control register</description>
          <addressOffset>0x388</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_PLD_RST</name>
              <description>set this bit to reset preload-logic inside L2-Cache. Recommend that this should only be used to initialize preload-logic when some fatal error of preload-logic occurs.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_AUTOLOAD_BUF_CLR_CTRL</name>
          <description>Cache Autoload buffer clear control register</description>
          <addressOffset>0x38C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_ALD_BUF_CLR</name>
              <description>set this bit to clear autoload-buffer inside L2-Cache. If this bit is active, autoload will not work in L2-Cache. This bit should not be active when autoload works in L2-Cache.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_UNALLOCATE_BUFFER_CLEAR</name>
          <description>Unallocate request buffer clear registers</description>
          <addressOffset>0x390</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_UNALLOC_CLR</name>
              <description>The bit is used to clear the unallocate request buffer of l2 icache where the unallocate request is responsed but not completed.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_ACCESS_ATTR_CTRL</name>
          <description>L1 Cache access Attribute propagation control register</description>
          <addressOffset>0x394</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>L2_CACHE_ACCESS_FORCE_CC</name>
              <description>Set this bit to force the request to l2 cache with cacheable attribute, otherwise, the attribute is propagated from L1 cache or CPU, it could be one of cacheable and non-cacheable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_ACCESS_FORCE_WB</name>
              <description>Set this bit to force the request to l2 cache with write-back attribute, otherwise, the attribute is propagated from L1 cache or CPU, it could be one of write-back and write-through.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_ACCESS_FORCE_WMA</name>
              <description>Set this bit to force the request to l2 cache with write-miss-allocate attribute, otherwise, the attribute is propagated from L1 cache or CPU, it could be one of write-miss-allocate and write-miss-no-allocate.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_ACCESS_FORCE_RMA</name>
              <description>Set this bit to force the request to l2 cache with read-miss-allocate attribute, otherwise, the attribute is propagated from L1 cache or CPU, it could be one of read-miss-allocate and read-miss-no-allocate.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_OBJECT_CTRL</name>
          <description>Cache Tag and Data memory Object control register</description>
          <addressOffset>0x398</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_TAG_OBJECT</name>
              <description>Set this bit to set L2-Cache tag memory as object. This bit should be onehot with the others fields inside this register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_MEM_OBJECT</name>
              <description>Set this bit to set L2-Cache data memory as object. This bit should be onehot with the others fields inside this register.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_WAY_OBJECT</name>
          <description>Cache Tag and Data memory way register</description>
          <addressOffset>0x39C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_WAY_OBJECT</name>
              <description>Set this bits to select which way of the tag-object will be accessed. 0: way0, 1: way1, 2: way2, 3: way3, ?, 7: way7.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_VADDR</name>
          <description>Cache Vaddr register</description>
          <addressOffset>0x3A0</addressOffset>
          <size>0x20</size>
          <resetValue>0x40000000</resetValue>
          <fields>
            <field>
              <name>L2_CACHE_VADDR</name>
              <description>Those bits stores the virtual address which will decide where inside the specified tag memory object will be accessed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_DEBUG_BUS</name>
          <description>Cache Tag/data memory content register</description>
          <addressOffset>0x3A4</addressOffset>
          <size>0x20</size>
          <resetValue>0x000003A4</resetValue>
          <fields>
            <field>
              <name>L2_CACHE_DEBUG_BUS</name>
              <description>This is a constant place where we can write data to or read data from the tag/data memory on the specified cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LEVEL_SPLIT1</name>
          <description>USED TO SPLIT L1 CACHE AND L2 CACHE</description>
          <addressOffset>0x3A8</addressOffset>
          <size>0x20</size>
          <resetValue>0x000003A8</resetValue>
          <fields>
            <field>
              <name>LEVEL_SPLIT1</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Clock gate control register</description>
          <addressOffset>0x3AC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>The bit is used to enable clock gate when access all registers in this module.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REDUNDANCY_SIG0</name>
          <description>Cache redundancy signal 0 register</description>
          <addressOffset>0x3B0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_REDCY_SIG0</name>
              <description>Those bits are prepared for ECO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REDUNDANCY_SIG1</name>
          <description>Cache redundancy signal 1 register</description>
          <addressOffset>0x3B4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_REDCY_SIG1</name>
              <description>Those bits are prepared for ECO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REDUNDANCY_SIG2</name>
          <description>Cache redundancy signal 2 register</description>
          <addressOffset>0x3B8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_REDCY_SIG2</name>
              <description>Those bits are prepared for ECO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REDUNDANCY_SIG3</name>
          <description>Cache redundancy signal 3 register</description>
          <addressOffset>0x3BC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_REDCY_SIG3</name>
              <description>Those bits are prepared for ECO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REDUNDANCY_SIG4</name>
          <description>Cache redundancy signal 0 register</description>
          <addressOffset>0x3C0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_REDCY_SIG4</name>
              <description>Those bits are prepared for ECO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x02202080</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>version control register. Note that this default value stored is the latest date when the hardware logic was updated.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
