esp-rs/esp-pacs/esp32h2/svd/esp32h2.base.svd
        <register>
          <name>TG0_T0_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TG0_T0_INTR_MAP</name>
              <description>CORE0_TG0_T0_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TG0_WDT_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TG0_WDT_INTR_MAP</name>
              <description>CORE0_TG0_WDT_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TG1_T0_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TG1_T0_INTR_MAP</name>
              <description>CORE0_TG1_T0_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TG1_WDT_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TG1_WDT_INTR_MAP</name>
              <description>CORE0_TG1_WDT_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTIMER_TARGET0_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYSTIMER_TARGET0_INTR_MAP</name>
              <description>CORE0_SYSTIMER_TARGET0_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTIMER_TARGET1_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYSTIMER_TARGET1_INTR_MAP</name>
              <description>CORE0_SYSTIMER_TARGET1_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTIMER_TARGET2_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYSTIMER_TARGET2_INTR_MAP</name>
              <description>CORE0_SYSTIMER_TARGET2_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_ADC_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB_ADC_INTR_MAP</name>
              <description>CORE0_APB_ADC_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PWM_INTR_MAP</name>
              <description>CORE0_PWM_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNT_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PCNT_INTR_MAP</name>
              <description>CORE0_PCNT_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARL_IO_TX_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARL_IO_TX_INTR_MAP</name>
              <description>CORE0_PARL_IO_TX_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARL_IO_RX_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARL_IO_RX_INTR_MAP</name>
              <description>CORE0_PARL_IO_RX_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_IN_CH0_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_IN_CH0_INTR_MAP</name>
              <description>CORE0_DMA_IN_CH0_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_IN_CH1_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_IN_CH1_INTR_MAP</name>
              <description>CORE0_DMA_IN_CH1_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_IN_CH2_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_IN_CH2_INTR_MAP</name>
              <description>CORE0_DMA_IN_CH2_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_OUT_CH0_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_OUT_CH0_INTR_MAP</name>
              <description>CORE0_DMA_OUT_CH0_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_OUT_CH1_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_OUT_CH1_INTR_MAP</name>
              <description>CORE0_DMA_OUT_CH1_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_OUT_CH2_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_OUT_CH2_INTR_MAP</name>
              <description>CORE0_DMA_OUT_CH2_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPSPI2_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GPSPI2_INTR_MAP</name>
              <description>CORE0_GPSPI2_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AES_INTR_MAP</name>
              <description>CORE0_AES_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SHA_INTR_MAP</name>
              <description>CORE0_SHA_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSA_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RSA_INTR_MAP</name>
              <description>CORE0_RSA_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ECC_INTR_MAP</name>
              <description>CORE0_ECC_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECDSA_INTR_MAP</name>
          <description>register description</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ECDSA_INTR_MAP</name>
              <description>CORE0_ECDSA_INTR mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_STATUS_REG_0</name>
          <description>register description</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_STATUS_0</name>
              <description>Status register for interrupt sources 0~31 mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_STATUS_REG_1</name>
          <description>register description</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_STATUS_1</name>
              <description>Status register for interrupt sources 32~63 mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_STATUS_REG_2</name>
          <description>register description</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_STATUS_2</name>
              <description>Status register for interrupt sources 64~95 mapping register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>register description</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>REG_CLK_EN</name>
              <description>Clock register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERRUPT_REG_DATE</name>
          <description>register description</description>
          <addressOffset>0x7FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x02209150</resetValue>
          <fields>
            <field>
              <name>INTERRUPT_REG_DATE</name>
              <description>Version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
